:PROPERTIES:
:ID:       B533849C-0F42-41EE-BE67-4430EDC9B9B3
:END:
#+title: Elastic Collision
#+author: Houjun Liu

We are given that the object $m_1$ collides with the rod with velocity $v_0$, and the rod is floating in free space. Given $m_1$, $v_0$, $m_2$, $I_0$, and $r$, we are to figure to the final velocity of $m_1$ after collision $v_f$, the velocity of $m_2$ after collision $v_{CM}$, and of course the rotation of the rod after collision $\omega$.

We are assuming that this collision elastic.

We have, then, for conservation of linear momentum:

\begin{equation}
 m_1 v_0 = m_1v_f + m_2 v_{CM} 
\end{equation}

Furthermore, we understand that kinetic energy is also conserved here; therefore:

\begin{align}
&\frac{1}{2} m_1{v_0}^2 = \left(\frac{1}{2} m_1{v_f}^2\right)+\left(\frac{1}{2} m_2{v_{CM}}^2\right)+\left(\frac{1}{2} I_0{\omega}^2\right)\\
\Rightarrow & m_1{v_0}^2 = \left( m_1{v_f}^2\right)+\left( m_2{v_{CM}}^2\right)+\left( I_0{\omega}^2\right)
\end{align}

as the point mass does not have any rotational inertia, and the rod is not rotating at the start.

Lastly, we understand that the angular velocity is the same as that which the ball travels after the collision; that:

\begin{equation}
   v_f = \omega R
\end{equation}

Actually setting up to solve the expressions, then:

#+begin_src sage
var("I m1 v0 m2 r")
var("vf vcm w")

solve([m1*v0 == m1*vf+m2*vcm, m1*v0^2==m1*vf^2+m2*vcm^2+I*w^2, vf==w*R], vf, vcm, w, to_poly_solve=True)
#+end_src

#+RESULTS:
: (I, m1, v0, m2, r)
: (vf, vcm, w)
: [[vf == v0, vcm == 0, w == 0]]
